Австралия/src/Catalogs/FinancialReportsItems/FinancialReportsItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>FinancialReportsItems</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.FinancialReportsTypes</owners>
  <attributes>
    <name>ItemType</name>
    <type>
      <types>EnumRef.FinancialReportItemsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrinting</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReverseSign</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalFilter</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>HasSettings</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AnalyticsValue</name>
    <type>
      <types>ChartOfAccountsRef</types>
    </type>
  </attributes>
  <attributes>
    <name>LinkedItem</name>
    <type>
      <types>CatalogRef.FinancialReportsItems</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemTypeAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FormulaOperands</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Operand</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TableItems</name>
    <attributes>
      <name>Row</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Column</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalFields</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputTitle</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InSeparateColumn</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItems</name>
    <attributes>
      <name>Appearance</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceAppliedAreaType</name>
      <type>
        <types>EnumRef.AppearanceAppliedAreasTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedRows</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedColumns</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItemsFilterFieldsDetails</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>FilterFieldName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ResourceName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ValuesSources</name>
    <attributes>
      <name>Source</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AddedDocumentValues</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/FinancialReportItemsTypes/FinancialReportItemsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FinancialReportItemsTypes</name>
  <enumValues>
    <name>ReportTitle</name>
  </enumValues>
  <enumValues>
    <name>NonEditableText</name>
  </enumValues>
  <enumValues>
    <name>EditableText</name>
  </enumValues>
  <enumValues>
    <name>AccountingDataIndicator</name>
  </enumValues>
  <enumValues>
    <name>UserDefinedFixedIndicator</name>
  </enumValues>
  <enumValues>
    <name>BudgetItem</name>
  </enumValues>
  <enumValues>
    <name>BudgetItemsAll</name>
  </enumValues>
  <enumValues>
    <name>BudgetIndicator</name>
  </enumValues>
  <enumValues>
    <name>BudgetIndicatorsAll</name>
  </enumValues>
  <enumValues>
    <name>UserDefinedCalculatedIndicator</name>
  </enumValues>
  <enumValues>
    <name>NonfinancialIndicator</name>
  </enumValues>
  <enumValues>
    <name>EditableValue</name>
  </enumValues>
  <enumValues>
    <name>TableIndicatorsInRows</name>
  </enumValues>
  <enumValues>
    <name>TableIndicatorsInColumns</name>
  </enumValues>
  <enumValues>
    <name>TableComplex</name>
  </enumValues>
  <enumValues>
    <name>TableItem</name>
  </enumValues>
  <enumValues>
    <name>Columns</name>
  </enumValues>
  <enumValues>
    <name>Rows</name>
  </enumValues>
  <enumValues>
    <name>ConfigureCells</name>
  </enumValues>
  <enumValues>
    <name>TableCell</name>
  </enumValues>
  <enumValues>
    <name>Dimension</name>
  </enumValues>
  <enumValues>
    <name>Group</name>
  </enumValues>
  <enumValues>
    <name>GroupTotal</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/FinancialReportsItems/Forms/ValuesSources/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Var Cache;
	
	Filling = False;
	If Parameters.Property("Filling") Then
		Filling = Parameters.Filling;
	EndIf;
	
	ItemsTree = GetFromTempStorage(Parameters.ReportItemsAddress);
	TreeRow = FinancialReportingClientServer.ChildItem(ItemsTree, "ItemStructureAddress", Parameters.ItemAddressInTempStorage);
	AvailableItemsList = FinancialReportingServer.ItemValuesSources(Cache, TreeRow, Filling);
	
	PreviousSourcesTable = Parameters.ValuesSources.Unload(New Structure("AddedDocumentValues", False));
	SourcesTree = FormAttributeToValue("ValuesSources");
	
	NewRow = Undefined;
	For Each AvailableItemsRow In AvailableItemsList Do
		Item = AvailableItemsRow.Item;
		If ValueIsFilled(AvailableItemsRow.Parent) Then
			AddingPlace = SourcesTree.Rows.Find(AvailableItemsRow.Parent, "Source", True);
		Else
			AddingPlace = SourcesTree;
		EndIf;
		NewRow = AddingPlace.Rows.Add();
		NewRow.Source = Item;
		If TypeOf(Item) = Type("String") Then
			ObjectAttributes = GetFromTempStorage(Item);
		Else
			ObjectAttributes = New Structure("Ref", Item);
		EndIf;
		NewRow.ItemType = AvailableItemsRow.ItemType;
		NewRow.Presentation = AvailableItemsRow.Description;
		NewRow.NonstandardPicture = FinancialReportingCached.NonstandardPicture(NewRow.ItemType);
		For Each ItemRow In PreviousSourcesTable Do
			If ItemRow.Source = ObjectAttributes.Ref Or ItemRow.Source = Item Then
				NewRow.Use = True;
				Break;
			EndIf;
		EndDo;
	EndDo;
	
	FillFlagsByChildItems(FinancialReportingClientServer.ChildItems(SourcesTree));
	
	ValueToFormAttribute(SourcesTree, "ValuesSources");
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	ChildRows = FinancialReportingClientServer.ChildItems(ValuesSources);
	For Each ChildRow In ChildRows Do
		Items.ValuesSources.Expand(ChildRow.GetID(), True);
	EndDo;
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersValuesSources

&AtClient
Procedure ValuesSourcesUseOnChange(Item)
	
	CurrentData = Items.ValuesSources.CurrentData;
	If CurrentData.Use = 2 Then
		CurrentData.Use = 0;
	EndIf;
	
	FillChildItemsFlags(FinancialReportingClientServer.ChildItems(CurrentData), CurrentData.Use);
	
	Parent = FinancialReportingClientServer.ParentItem(CurrentData);
	While Parent <> Undefined Do
		ChildRows = FinancialReportingClientServer.ChildItems(Parent);
		Parent.Use = FillFlagsByChildItems(ChildRows, False);
		Parent = FinancialReportingClientServer.ParentItem(Parent);
	EndDo;
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure Select(Command)
	
	Close(GetSelectionResult());
	
EndProcedure

&AtClient
Procedure CheckAll(Command)
	
	FillChildItemsFlags(FinancialReportingClientServer.ChildItems(ValuesSources), 1);
	
EndProcedure

&AtClient
Procedure UncheckAll(Command)
	
	FillChildItemsFlags(FinancialReportingClientServer.ChildItems(ValuesSources), 0);
	
EndProcedure

&AtClient
Procedure ExpandAll(Command)

	ChildRows = FinancialReportingClientServer.ChildItems(ValuesSources);
	For Each ChildRow In ChildRows Do
		Items.ValuesSources.Expand(ChildRow.GetID(), True);
	EndDo;
	
EndProcedure

&AtClient
Procedure CollapseAll(Command)

	ChildRows = FinancialReportingClientServer.ChildItems(ValuesSources);
	CollapseRow(ChildRows);
	
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure FillChildItemsFlags(Rows, Flag)
	
	For Each Row In Rows Do
		Row.Use = Flag;
		ChildRows = FinancialReportingClientServer.ChildItems(Row);
		FillChildItemsFlags(ChildRows, Flag);
	EndDo;
	
EndProcedure

&AtServer
Function GetSelectionResult()
	
	Result = New Array;
	FoundRows = FormAttributeToValue("ValuesSources").Rows.FindRows(New Structure("Use", 1), True);
	AvailableTypesArray = New Array;
	AvailableTypesArray.Add(Enums.FinancialReportItemsTypes.BudgetItem);
	AvailableTypesArray.Add(Enums.FinancialReportItemsTypes.BudgetIndicator);
	AvailableTypesArray.Add(Enums.FinancialReportItemsTypes.NonfinancialIndicator);
	
	For Each FoundRow In FoundRows Do
		If FoundRow.Rows.Count() Then
			Continue;
		EndIf;
		If AvailableTypesArray.Find(FoundRow.ItemType) = Undefined Then
			Continue;
		EndIf;
		Result.Add(FoundRow.Source);
	EndDo;
	
	Return Result;
	
EndFunction

&AtClientAtServerNoContext
Function FillFlagsByChildItems(TreeRows, IncludeChildItems = True)
	
	CurrentLevelFlagsArray = New Array;
	For Each Row In TreeRows Do
		
		If IncludeChildItems Then
			ChildRows = FinancialReportingClientServer.ChildItems(Row);
		EndIf;
		If IncludeChildItems And ChildRows.Count() Then
			Row.Use = FillFlagsByChildItems(ChildRows);
		EndIf;
		CurrentLevelFlagsArray.Add(Row.Use);
		
	EndDo;
	
	Result = CommonClientServer.CollapseArray(CurrentLevelFlagsArray);
	If Result.Count() = 2 Then
		Return 2;
	ElsIf Result.Count() Then
		Return Result[0];
	EndIf;
	
EndFunction

&AtClient
Procedure CollapseRow(TreeRows)
	
	For Each Row In TreeRows Do
		ChildRows = FinancialReportingClientServer.ChildItems(Row);
		CollapseRow(ChildRows);
		Items.ValuesSources.Collapse(Row.GetID());
	EndDo;
	
EndProcedure

#EndRegion
